*>
*> (c)2026 Ira Parsons
*> db2.sqb - db2 database routines (sql exec version)
*>

*>***************************************************************************
*>* DB2-INIT
*>*  - Connect to DB2 database
*>***************************************************************************

IDENTIFICATION DIVISION.
PROGRAM-ID. DB2-INIT.

DATA DIVISION.
WORKING-STORAGE SECTION.

    01 I PIC 9(5) COMP-5. *> int

    01 DB2-PASSWORD.
	    05 DB2-PASSWORD-LEN PIC S9(4) COMP-5 VALUE 11.
	    05 DB2-PASSWORD-DAT PIC X(18) VALUE "db2password".
	01 DB2-USERNAME PIC X(8)  VALUE "db2inst1".

    COPY dd-db2.

PROCEDURE DIVISION.

    PERFORM INIT-INSTANCE.

    GOBACK.

INIT-INSTANCE.

    *> attach to coblsky with db2inst1
	EXEC SQL
	    CONNECT TO COBLSKY USER :DB2-USERNAME USING :DB2-PASSWORD
	END-EXEC.

    EXIT PARAGRAPH.

END PROGRAM DB2-INIT.

*>***************************************************************************
*>* DB2-FINI
*>*  - Disconnect from DB2 database
*>***************************************************************************

IDENTIFICATION DIVISION.
PROGRAM-ID. DB2-FINI.

DATA DIVISION.
WORKING-STORAGE SECTION.

    01 I PIC 9(5) COMP-5. *> int

    COPY dd-db2.

PROCEDURE DIVISION.

    PERFORM FINI-INSTANCE.

	GOBACK.

FINI-INSTANCE.

    *> detach from database
    EXEC SQL
	    CONNECT RESET
	END-EXEC.

    EXIT PARAGRAPH.

END PROGRAM DB2-FINI.
