       *>
       *> (c)2026 Ira Parsons
       *> db2.sqb - db2 database routines (sql exec version)
       *>

        >>SOURCE FIXED

       *>***************************************************************************
       *>* DB2-INIT
       *>*  - Connect to DB2 database
       *>***************************************************************************

        IDENTIFICATION DIVISION.
        PROGRAM-ID. DB2-INIT.

        DATA DIVISION.
        WORKING-STORAGE SECTION.

            01 I PIC 9(5) COMP-5. *> int

            COPY dd-db2.

        PROCEDURE DIVISION.

            PERFORM INIT-INSTANCE.

            GOBACK.

        INIT-INSTANCE.

            *> attach to coblsky
            EXEC SQL
                CONNECT TO COBLSKY
            END-EXEC.

            EXIT PARAGRAPH.

        END PROGRAM DB2-INIT.

       *>***************************************************************************
       *>* DB2-FINI
       *>*  - Disconnect from DB2 database
       *>***************************************************************************

        IDENTIFICATION DIVISION.
        PROGRAM-ID. DB2-FINI.

        DATA DIVISION.
        WORKING-STORAGE SECTION.

            01 I PIC 9(5) COMP-5. *> int

            COPY dd-db2.

        PROCEDURE DIVISION.

            PERFORM FINI-INSTANCE.

            GOBACK.

        FINI-INSTANCE.

            *> detach from database
            EXEC SQL
                CONNECT RESET
            END-EXEC.

            EXIT PARAGRAPH.

        END PROGRAM DB2-FINI.
