*>
*> (c)2026 Ira Parsons
*> coblsky - a cobol at proto pds
*>

IDENTIFICATION DIVISION.
PROGRAM-ID. COBLSKY.

DATA DIVISION.
WORKING-STORAGE SECTION.
	
	COPY dd-network.
	
	01 DONE PIC 9 VALUE 0.

PROCEDURE DIVISION.

    CALL "NETWORK-INIT".

	CALL "NETWORK-OPEN" USING NETWORK-SOCKET.
	
	IF SOCK-FD EQUALS -1 THEN
	    STOP RUN.
	
	PERFORM UNTIL DONE EQUALS 1
	
	    CALL "NETWORK-CONNECT" USING NETWORK-SOCKET, NETWORK-CONNECTION
		
		CALL "NETWORK-RECEIVE" USING NETWORK-CONNECTION, NETWORK-PACKET
		
		IF PACKET-LEN EQUALS 0 THEN
		    MOVE 1 TO DONE
		ELSE
		    DISPLAY PACKET-DATA(1:PACKET-LEN)
		
		CALL "NETWORK-DISCONNECT" USING NETWORK-SOCKET, NETWORK-CONNECTION
		   
	END-PERFORM.

    CALL "NETWORK-CLOSE" USING NETWORK-SOCKET.
	
	CALL "NETWORK-FINI".

	STOP RUN.
