*>
*> (c)2026 Ira Parsons
*> coblsky - a cobol at proto pds
*>

IDENTIFICATION DIVISION.
PROGRAM-ID. COBLSKY.

DATA DIVISION.
WORKING-STORAGE SECTION.
	
	COPY dd-network.
	
	01 DONE PIC 9 VALUE 0.

PROCEDURE DIVISION.

    *> initialize submodules
    CALL "NETWORK-INIT" USING NETWORK-SSL-CONTEXT.
    CALL "DB2-CONNECT".

    *> network setup
    PERFORM SETUP-HTTPS-SOCKET.

    *> main loop
	PERFORM UNTIL DONE EQUAL 1

	    *> accept connection
	    CALL "NETWORK-CONNECT" USING NETWORK-SSL-CONTEXT, NETWORK-SOCKET, NETWORK-CONNECTION

        *> handle request
		IF CONN-FD NOT EQUAL -1 THEN
		    PERFORM HANDLE-CLIENT

	END-PERFORM.

    *> network teardown
    CALL "NETWORK-CLOSE" USING NETWORK-SOCKET.

    *> shutdown submodules
	CALL "NETWORK-FINI".

	STOP RUN.

SETUP-HTTP-SOCKET.
    MOVE 0 TO SOCK-SECURED.

    CALL "NETWORK-OPEN" USING NETWORK-SOCKET.

    IF SOCK-FD EQUAL -1 THEN
	    STOP RUN.

    EXIT PARAGRAPH.

SETUP-HTTPS-SOCKET.
	MOVE 1 TO SOCK-SECURED.

	CALL "NETWORK-OPEN" USING NETWORK-SOCKET.
	
	IF SOCK-FD EQUAL -1 THEN
	    STOP RUN.

    EXIT PARAGRAPH.

HANDLE-CLIENT.
	CALL "NETWORK-RECEIVE" USING NETWORK-CONNECTION, NETWORK-PACKET.

	IF PACKET-LEN EQUAL 0 THEN
	    MOVE 1 TO DONE
	ELSE
		DISPLAY PACKET-DATA(1:PACKET-LEN)
	    CALL "HTTP-HANDLE" USING NETWORK-PACKET
		DISPLAY PACKET-DATA(1:PACKET-LEN)
		CALL "NETWORK-SEND" USING NETWORK-CONNECTION, NETWORK-PACKET.
	
	CALL "NETWORK-DISCONNECT" USING NETWORK-CONNECTION.

	EXIT PARAGRAPH.

END PROGRAM COBLSKY.
