*>
*> (c)2026 Ira Parsons
*> coblsky - a cobol at proto pds
*>

IDENTIFICATION DIVISION.
PROGRAM-ID. COBLSKY.

DATA DIVISION.
WORKING-STORAGE SECTION.
	
	COPY dd-network.
	
	01 DONE PIC 9 VALUE 0.

PROCEDURE DIVISION.

    CALL "NETWORK-INIT" USING NETWORK-SSL-CONTEXT.

    PERFORM SETUP-HTTPS-SOCKET.

	PERFORM UNTIL DONE EQUALS 1
	
	    CALL "NETWORK-CONNECT" USING NETWORK-SSL-CONTEXT, NETWORK-SOCKET, NETWORK-CONNECTION

		IF CONN-FD EQUALS -1 THEN
			DISPLAY "CONNECTION FAILED"
		ELSE
		    PERFORM HANDLE-CLIENT
		   
	END-PERFORM.

    CALL "NETWORK-CLOSE" USING NETWORK-SOCKET.
	
	CALL "NETWORK-FINI".

	STOP RUN.

SETUP-HTTPS-SOCKET.
	CALL "NETWORK-OPEN" USING NETWORK-SOCKET.
	
	IF SOCK-FD EQUALS -1 THEN
	    STOP RUN.

	MOVE 1 TO SOCK-SECURED.

    EXIT PARAGRAPH.

HANDLE-CLIENT.
	CALL "NETWORK-RECEIVE" USING NETWORK-CONNECTION, NETWORK-PACKET.

	IF PACKET-LEN EQUALS 0 THEN
	    MOVE 1 TO DONE
	ELSE
		DISPLAY PACKET-DATA(1:PACKET-LEN)
		*>MOVE 55 TO PACKET-LEN
		*>MOVE "HTTP/1.1 200 OK" TO PACKET-DATA(1:15)
		*>MOVE X"0D0A" TO PACKET-DATA(16:18)
		*>MOVE "Content-Type: text/html" TO PACKET-DATA(19:42)
		*>MOVE X"0D0A0D0A" TO PACKET-DATA(43:47)
		*>MOVE z"<html>" TO PACKET-DATA(48:54)
		*>DISPLAY PACKET-DATA(1:PACKET-LEN)
		*>CALL "NETWORK-SEND" USING NETWORK-CONNECTION, NETWORK-PACKET.
	
	CALL "NETWORK-DISCONNECT" USING NETWORK-CONNECTION.

	EXIT PARAGRAPH.

END PROGRAM COBLSKY.
