*>
*> (c)2026 Ira Parsons
*> db2.sqb - db2 database routines
*>

*>***************************************************************************
*>* DB2-INIT
*>*  - Connect to DB2 database
*>***************************************************************************

IDENTIFICATION DIVISION.
PROGRAM-ID. DB2-INIT.

DATA DIVISION.
WORKING-STORAGE SECTION.

    01 I PIC 9(5) COMP-5. *> int

    01 DB2-PASSWORD PIC X(12) VALUE z"db2password".
	01 DB2-USERNAME PIC X(9)  VALUE z"db2inst1".
	01 DB2-INSTNAME PIC X(9)  VALUE z"db2inst1".

LINKAGE SECTION.

    COPY dd-db2.

PROCEDURE DIVISION USING DB-CONNECTION.

    PERFORM INIT-INSTANCE.

    GOBACK.

>>IF GCOBOL IS DEFINED
>>CALL-CONVENTION C
>>END-IF
*>>>IF COBC IS DEFINED
*>>>CALL-CONVENTION STDCALL
*>>>END-IF
INIT-INSTANCE.

    *> attach to db2inst1
	CALL "sqlgatin" USING BY VALUE 11, BY VALUE 8, BY VALUE 8, BY REFERENCE SQLCA, BY REFERENCE DB2-PASSWORD, BY REFERENCE DB2-USERNAME, BY REFERENCE DB2-INSTNAME RETURNING I.

    EXIT PARAGRAPH.
>>CALL-CONVENTION COBOL

END PROGRAM DB2-INIT.

*>***************************************************************************
*>* DB2-FINI
*>*  - Disconnect from DB2 database
*>***************************************************************************

IDENTIFICATION DIVISION.
PROGRAM-ID. DB2-FINI.

DATA DIVISION.
WORKING-STORAGE SECTION.

    01 I PIC 9(5) COMP-5. *> int

LINKAGE SECTION.

    COPY dd-db2.

PROCEDURE DIVISION USING DB-CONNECTION.

    PERFORM FINI-INSTANCE.

	GOBACK.

>>IF GCOBOL IS DEFINED
>>CALL-CONVENTION C
>>END-IF
*>>>IF COBC IS DEFINED
*>>>CALL-CONVENTION STDCALL
*>>>END-IF
FINI-INSTANCE.

    *> detach from db2inst1
	CALL "sqlgdtin" USING BY REFERENCE SQLCA RETURNING I.

    EXIT PARAGRAPH.
>>CALL-CONVENTION COBOL

END PROGRAM DB2-FINI.
