	*>
	*> (c)2026 Ira Parsons
	*> dd-string.cpy - string data structures
	*>

    01 (PFX)-STRING.
	    05 (PFX)-LEN               PIC S9(5) COMP-5. *> int
		05 (PFX)-DAT               PIC X(2048).      *> arbitary max length