*>
*> (c)2026 Ira Parsons
*> http.cbl - http processing routines
*>

*>***************************************************************************
*>* HTTP-HANDLE
*>*  - Parse HTTP message and respond accordingly
*>***************************************************************************

IDENTIFICATION DIVISION.
PROGRAM-ID. HTTP-HANDLE.

DATA DIVISION.
WORKING-STORAGE SECTION.

    01 I        PIC S9(5) COMP-5. *> int
	01 A        PIC S9(5) COMP-5. *> int

    01 REQ-TYPE PIC 9.

	COPY dd-string REPLACING ==(PFX)== BY ==CRLF-STR==.
	COPY dd-string REPLACING ==(PFX)== BY ==CURR-LINE==.
	01 CURR-LINE-OFF PIC S9(5) COMP-5 VALUE 1. *> offset of current line in packet data
	
	COPY dd-string REPLACING ==(PFX)== BY ==REQUEST-TARGET==.
	COPY dd-string REPLACING ==(PFX)== BY ==XRPC-TARGET==.

	COPY dd-string REPLACING ==(PFX)== BY ==FDEL-STR==.
	COPY dd-string REPLACING ==(PFX)== BY ==FIELD-KEY==.
	COPY dd-string REPLACING ==(PFX)== BY ==FIELD-VAL==.

	COPY dd-string REPLACING ==(PFX)== BY ==TEMP==.

    COPY dd-http.

LINKAGE SECTION.

    COPY dd-network.

PROCEDURE DIVISION USING NETWORK-PACKET.

    PERFORM HANDLE-SETUP.

    *> handle header
    PERFORM HANDLE-STATUS-LINE.
	PERFORM HANDLE-FIELD-LINES.

    *> load body
	PERFORM HANDLE-BODY.

    *> act accordingly
	PERFORM HANDLE-HANDLE.

    GOBACK.

HANDLE-SETUP.
    *> reinitialize variables
	MOVE 0 TO I.
	MOVE 0 TO A.
	MOVE 0 TO CURR-LINE-LEN.
	MOVE 1 TO CURR-LINE-OFF.

    *> http line delimeter
    MOVE 2 TO CRLF-STR-LEN.
	MOVE X"0D0A" TO CRLF-STR-DAT(1:2).

    *> http field delimeter
	MOVE 2 TO FDEL-STR-LEN.
	MOVE ": " TO FDEL-STR-DAT(1:2).

    *> clear existing http options
	MOVE 0 TO HTTP-REASON-TEXT-LEN.

    EXIT PARAGRAPH.

HANDLE-STATUS-LINE.
    *> parse status line
    PERFORM HANDLE-GETLINE.

    IF I EQUALS -1 THEN
	    GOBACK.

	*> extract method
	CALL "STRING-STRCHR" USING CURR-LINE-STRING, BY VALUE " ", BY REFERENCE A.

    IF A IS LESS THAN 1 THEN
	    GOBACK.

    EVALUATE PACKET-DATA(1:A - 1)
	    WHEN "GET"
		    MOVE 0 TO REQ-TYPE
		WHEN "POST"
		    MOVE 1 TO REQ-TYPE
		WHEN "HEAD"
		    MOVE 2 TO REQ-TYPE
		WHEN OTHER
		    GOBACK
	END-EVALUATE.

    *> extract request target
	ADD 1 TO A.
	COMPUTE TEMP-LEN = CURR-LINE-LEN - A;
	MOVE CURR-LINE-DAT(A:TEMP-LEN) TO TEMP-DAT.
	CALL "STRING-STRCHR" USING TEMP-STRING, BY VALUE " ", BY REFERENCE I.

    IF I IS LESS THAN 1 THEN
	    GOBACK.

    COMPUTE REQUEST-TARGET-LEN = I - 1;
    MOVE CURR-LINE-DAT(A:REQUEST-TARGET-LEN) TO REQUEST-TARGET-DAT.
	ADD I TO A.

    *> extract http version
	COMPUTE TEMP-LEN = CURR-LINE-LEN - A;
	MOVE CURR-LINE-DAT(A:TEMP-LEN) TO TEMP-DAT.

    IF (TEMP-LEN IS LESS THAN 8) OR (TEMP-DAT(1:8) NOT EQUALS "HTTP/1.1") THEN
	    GOBACK.

    EXIT-PARAGRAPH.

HANDLE-FIELD-LINES.
    *> evaluate field lines
	PERFORM HANDLE-GETLINE.

    IF I EQUALS -1 THEN
	    GOBACK.

    PERFORM UNTIL CURR-LINE-LEN IS LESS THAN 3
	    *> read in key and value
	    CALL "STRING-STRSTR" USING CURR-LINE-STRING, FDEL-STR-STRING, I

        IF I EQUALS -1 THEN
		    GOBACK
        END-IF

		COMPUTE FIELD-KEY-LEN = I - FDEL-STR-LEN;
		MOVE CURR-LINE-DAT(1:FIELD-KEY-LEN) TO FIELD-KEY-DAT
		ADD 1 TO I
		COMPUTE FIELD-VAL-LEN = CURR-LINE-LEN - CRLF-STR-LEN - FIELD-KEY-LEN - FDEL-STR-LEN;
		MOVE CURR-LINE-DAT(I:FIELD-VAL-LEN) TO FIELD-VAL-DAT

		*> act on header	
		EVALUATE FIELD-KEY-DAT(1:FIELD-KEY-LEN)
		    WHEN "Content-Type"
			    IF FIELD-VAL-LEN IS GREATER THAN 255 THEN
				    MOVE 255 TO FIELD-VAL-LEN
				END-IF
				MOVE FIELD-VAL-LEN TO HTTP-CONTENT-TYPE-LEN
				MOVE FIELD-VAL-DAT(1:FIELD-VAL-LEN) TO HTTP-CONTENT-TYPE-DAT(1:FIELD-VAL-LEN)
			    CONTINUE
			WHEN "Authorization"
			    CONTINUE
			WHEN "atproto-proxy"
			    CONTINUE
			WHEN "atproto-accept-labelers"
			    CONTINUE
		    WHEN OTHER
			    CONTINUE
		END-EVALUATE

        *> load next line
        PERFORM HANDLE-GETLINE

        IF I EQUALS -1 THEN
		    GOBACK
		END-IF
	END-PERFORM.

    *> look for end of header
	IF CURR-LINE-LEN NOT EQUALS 2 THEN
	    GOBACK.

    EXIT-PARAGRAPH.

HANDLE-BODY.
    *> load body
	ADD CURR-LINE-LEN TO CURR-LINE-OFF.

	IF CURR-LINE-OFF IS GREATER THAN OR EQUAL TO PACKET-LEN THEN
	    MOVE 0 TO TEMP-LEN
	ELSE
		COMPUTE TEMP-LEN = PACKET-LEN - CURR-LINE-OFF;
		MOVE PACKET-DATA(CURR-LINE-OFF:TEMP-LEN) TO TEMP-DAT.

    EXIT PARAGRAPH.

HANDLE-HANDLE.
    *> process request
	IF REQUEST-TARGET-DAT EQUALS "/" THEN
		*> add encoding header
		MOVE 9 TO HTTP-CONTENT-TYPE-LEN
		MOVE "text/html" TO HTTP-CONTENT-TYPE-DAT(1:HTTP-CONTENT-TYPE-LEN)
		*> load body
		MOVE 18 TO TEMP-LEN
		MOVE z"<html>test</html>" TO TEMP-DAT(1:18)
		MOVE 200 TO HTTP-STATUS-CODE
	ELSE
		IF (REQUEST-TARGET-LEN IS GREATER THAN 6) AND (REQUEST-TARGET-DAT(1:6) EQUALS "/xrpc/") THEN
			COMPUTE XRPC-TARGET-LEN = REQUEST-TARGET-LEN - 6;
			MOVE REQUEST-TARGET-DAT(7:XRPC-TARGET-LEN) TO XRPC-TARGET-DAT(1:XRPC-TARGET-LEN)
			CALL "XRPC-HANDLE" USING HTTP-OPTIONS, XRPC-TARGET-STRING, TEMP-STRING
		ELSE
			MOVE 0 TO HTTP-CONTENT-TYPE-LEN
			MOVE 0 TO TEMP-LEN
			MOVE 404 TO HTTP-STATUS-CODE.

    CALL "HTTP-PACKAGE" USING NETWORK-PACKET, HTTP-OPTIONS, TEMP-STRING.

    EXIT-PARAGRAPH.

HANDLE-GETLINE.
    *> find end of line
	ADD CURR-LINE-LEN TO CURR-LINE-OFF.
	COMPUTE TEMP-LEN = PACKET-LEN - CURR-LINE-OFF + 1;
	MOVE PACKET-DATA(CURR-LINE-OFF:TEMP-LEN) TO TEMP-DAT.
	CALL "STRING-STRSTR" USING TEMP-STRING, CRLF-STR-STRING, I.

	IF I EQUALS -1 THEN
	    EXIT PARAGRAPH.

	MOVE I TO CURR-LINE-LEN.
	MOVE PACKET-DATA(CURR-LINE-OFF:CURR-LINE-LEN) TO CURR-LINE-DAT.

    EXIT PARAGRAPH.

END PROGRAM HTTP-HANDLE.

*>***************************************************************************
*>* HTTP-PACKAGE
*>*  - Form status and body into http message
*>***************************************************************************

IDENTIFICATION DIVISION.
PROGRAM-ID. HTTP-PACKAGE.

DATA DIVISION.
WORKING-STORAGE SECTION.

    01 I PIC S9(5) COMP-5. *> int
	01 A PIC S9(5) COMP-5. *> int
	01 B PIC S9(5) COMP-5. *> int
	01 C PIC  9(2) COMP-5. *> int

    01 STATUS-CODE-STR PIC X(3).

    COPY dd-string REPLACING ==(PFX)== BY ==FIELD-KEY==.
    COPY dd-string REPLACING ==(PFX)== BY ==FIELD-VAL==.

LINKAGE SECTION.

    COPY dd-network.

    COPY dd-http.

    COPY dd-string REPLACING ==(PFX)== BY ==BODY==.

PROCEDURE DIVISION USING NETWORK-PACKET, HTTP-OPTIONS, BODY-STRING.

    PERFORM PACKAGE-SETUP.

    *> create header
	PERFORM PACKAGE-STATUS-LINE.
	PERFORM PACKAGE-FIELD-LINES.

    *> add body
	PERFORM PACKAGE-BODY.

    GOBACK.

PACKAGE-SETUP.

    *> clear packet
	MOVE 0 TO PACKET-LEN.
	MOVE 1 TO I.

    EXIT PARAGRAPH.

PACKAGE-STATUS-LINE.

    *> add version
	ADD 8 TO PACKET-LEN.
	MOVE "HTTP/1.1" TO PACKET-DATA(I:8).
	ADD 8 TO I.

    ADD 1 TO PACKET-LEN.
	MOVE " " TO PACKET-DATA(I:1).
	ADD 1 TO I.

    *> convert status code to string
	PERFORM VARYING A FROM 3 BY -1 UNTIL A IS LESS THAN 1
	    COMPUTE B = (HTTP-STATUS-CODE / (FUNCTION EXP10 (3 - A)));
		COMPUTE C = FUNCTION MOD (B, 10);
		ADD 48 TO C *> ascii '0' == 48
		MOVE C TO STATUS-CODE-STR(A:1)
	END-PERFORM.

    *> add status code
	ADD 3 TO PACKET-LEN.
	MOVE STATUS-CODE-STR(1:3) TO PACKET-DATA(I:3).
	ADD 3 TO I.

    ADD 1 TO PACKET-LEN.
	MOVE " " TO PACKET-DATA(I:1).
	ADD 1 TO I.

    *> determine reason string
	IF HTTP-REASON-TEXT-LEN EQUALS 0 THEN
	    *> if no custom string provided, guess from status code
		EVALUATE HTTP-STATUS-CODE
			WHEN 200
				MOVE 2 TO HTTP-REASON-TEXT-LEN
				MOVE "OK" TO HTTP-REASON-TEXT-DAT(1:HTTP-REASON-TEXT-LEN)
			WHEN 400
				MOVE 11 TO HTTP-REASON-TEXT-LEN
				MOVE "Bad Request" TO HTTP-REASON-TEXT-DAT(1:HTTP-REASON-TEXT-LEN)
			WHEN 401
				MOVE 12 TO HTTP-REASON-TEXT-LEN
				MOVE "Unauthorized" TO HTTP-REASON-TEXT-DAT(1:HTTP-REASON-TEXT-LEN)
			WHEN 403
				MOVE 9 TO HTTP-REASON-TEXT-LEN
				MOVE "Forbidden" TO HTTP-REASON-TEXT-DAT(1:HTTP-REASON-TEXT-LEN)
			WHEN 404
				MOVE 9 TO HTTP-REASON-TEXT-LEN
				MOVE "Not Found" TO HTTP-REASON-TEXT-DAT(1:HTTP-REASON-TEXT-LEN)
			WHEN 413
				MOVE 17 TO HTTP-REASON-TEXT-LEN
				MOVE "Payload Too Large" TO HTTP-REASON-TEXT-DAT(1:HTTP-REASON-TEXT-LEN)
			WHEN 429
				MOVE 17 TO HTTP-REASON-TEXT-LEN
				MOVE "Too Many Requests" TO HTTP-REASON-TEXT-DAT(1:HTTP-REASON-TEXT-LEN)
			WHEN 500
				MOVE 21 TO HTTP-REASON-TEXT-LEN
				MOVE "Internal Server Error" TO HTTP-REASON-TEXT-DAT(1:HTTP-REASON-TEXT-LEN)
			WHEN 501
				MOVE 15 TO HTTP-REASON-TEXT-LEN
				MOVE "Not Implemented" TO HTTP-REASON-TEXT-DAT(1:HTTP-REASON-TEXT-LEN)
			WHEN 502
				MOVE 11 TO HTTP-REASON-TEXT-LEN
				MOVE "Bad Gateway" TO HTTP-REASON-TEXT-DAT(1:HTTP-REASON-TEXT-LEN)
			WHEN 503
				MOVE 19 TO HTTP-REASON-TEXT-LEN
				MOVE "Service Unavailable" TO HTTP-REASON-TEXT-DAT(1:HTTP-REASON-TEXT-LEN)
			WHEN 504
				MOVE 15 TO HTTP-REASON-TEXT-LEN
				MOVE "Gateway Timeout" TO HTTP-REASON-TEXT-DAT(1:HTTP-REASON-TEXT-LEN)
			WHEN OTHER
				CONTINUE
		END-EVALUATE.

    *> add reason string
	ADD HTTP-REASON-TEXT-LEN TO PACKET-LEN.
	MOVE HTTP-REASON-TEXT-DAT(1:HTTP-REASON-TEXT-LEN) TO PACKET-DATA(I:HTTP-REASON-TEXT-LEN).
	ADD HTTP-REASON-TEXT-LEN TO I.

    *> add crlf
	ADD 2 TO PACKET-LEN.
	MOVE X"0D0A" TO PACKET-DATA(I:2).
	ADD 2 TO I.

    EXIT PARAGRAPH.

PACKAGE-FIELD-LINES.

    *> add headers
	IF HTTP-CONTENT-TYPE-LEN NOT EQUALS 0 THEN
	    MOVE 12 TO FIELD-KEY-LEN
		MOVE "Content-Type" TO FIELD-KEY-DAT(1:FIELD-KEY-LEN)
		MOVE HTTP-CONTENT-TYPE-LEN TO FIELD-VAL-LEN
		MOVE HTTP-CONTENT-TYPE-DAT(1:HTTP-CONTENT-TYPE-LEN) TO FIELD-VAL-DAT(1:HTTP-CONTENT-TYPE-LEN)
	    PERFORM PACKAGE-ADD-FIELD-LINE.

    *> add blank line
	ADD 2 TO PACKET-LEN.
	MOVE X"0D0A" TO PACKET-DATA(I:2).
	ADD 2 TO I.

    EXIT PARAGRAPH.

PACKAGE-ADD-FIELD-LINE.

	*> add field name
	ADD FIELD-KEY-LEN TO PACKET-LEN
	MOVE FIELD-KEY-DAT(1:FIELD-KEY-LEN) TO PACKET-DATA(I:FIELD-KEY-LEN)
	ADD FIELD-KEY-LEN TO I

	*> add delimeter
	ADD 2 TO PACKET-LEN
	MOVE ": " TO PACKET-DATA(I:2)
	ADD 2 TO I

	*> add field value
	ADD FIELD-VAL-LEN TO PACKET-LEN
	MOVE FIELD-VAL-DAT(1:FIELD-VAL-LEN) TO PACKET-DATA(I:FIELD-VAL-LEN)
	ADD FIELD-VAL-LEN TO I

	*> add crlf
	ADD 2 TO PACKET-LEN
	MOVE X"0D0A" TO PACKET-DATA(I:2)
	ADD 2 TO I

    EXIT PARAGRAPH.

PACKAGE-BODY.

    ADD BODY-LEN TO PACKET-LEN.
	MOVE BODY-DAT(1:BODY-LEN) TO PACKET-DATA(I:BODY-LEN).

    EXIT PARAGRAPH.

END PROGRAM HTTP-PACKAGE.
