*>
*> (c)2026 Ira Parsons
*> network.cbl - networking routines
*>

IDENTIFICATION DIVISION.
PROGRAM-ID. NETWORK-INIT.

DATA DIVISION.
WORKING-STORAGE SECTION.

    01 PORT            PIC 9(5) COMP-5.  *> int
	01 INADDR_ANY      PIC 9(5) COMP-5.  *> int
	01 AF_INET         PIC 9(5) COMP-5.  *> int
	01 SOCK_STREAM     PIC 9(5) COMP-5.  *> int
	01 SOL_SOCKET      PIC 9(5) COMP-5.  *> int
	01 SO_REUSEADDR    PIC 9(5) COMP-5.  *> int
	01 BACKLOG         PIC 9(5) COMP-5.  *> int

	01 SOCKOPT_VAL_LEN PIC 9(5) COMP-5.  *> size_t

	01 I               PIC S9(5) COMP-5. *> int
	
	01 PERROR-SOCKET   PIC A(7) VALUE z"socket".
	01 PERROR-SOCKOPT  PIC A(11) VALUE z"setsockopt".
	01 PERROR-BIND     PIC A(5) VALUE z"bind".
	01 PERROR-LISTEN   PIC A(7) VALUE z"listen".

LINKAGE SECTION.

    COPY dd-network.

PROCEDURE DIVISION USING NETWORK-SHARED.

	*> create socket
	MOVE 8080 TO PORT. *> HTTP port
	MOVE 0 TO INADDR_ANY. *> INADDR_ANY
	MOVE 2 TO AF_INET. *> AF_INET
	MOVE 1 TO SOCK_STREAM. *> SOCK_STREAM
	MOVE 1 TO SOL_SOCKET. *> SOL_SOCKET
	MOVE 2 TO SO_REUSEADDR. *> SO_REUSEADDR
	MOVE 64 TO BACKLOG. *> BACKLOG
	
	MOVE AF_INET TO SIN-FAMILY.
	CALL "htons" USING BY VALUE PORT RETURNING SIN-PORT.
	CALL "htonl" USING BY VALUE INADDR_ANY RETURNING SIN-ADDR.
	
	MOVE LENGTH OF SOCKADDR-IN TO SOCKADDR-IN-LEN.
	
	CALL "socket" USING BY VALUE AF_INET, BY VALUE SOCK_STREAM, BY VALUE 0 RETURNING SOCK-FD. *> create tcp socket

	IF SOCK-FD EQUALS -1 THEN
		CALL "perror" USING PERROR-SOCKET
	    GOBACK.
	
	*> set socket options to allow server restarts
	*> reusing SOCK_STREAM = 1 = sockopt val
	MOVE LENGTH OF SOCK_STREAM TO SOCKOPT_VAL_LEN.
	CALL "setsockopt" USING BY VALUE SOCK-FD, SOL_SOCKET, SO_REUSEADDR, BY REFERENCE SOCK_STREAM, BY VALUE SOCKOPT_VAL_LEN RETURNING I.

	IF I NOT EQUALS 0 THEN
		CALL "perror" USING PERROR-SOCKOPT
	    MOVE -1 TO SOCK-FD
		GOBACK.
	
	*> bind socket
	CALL "bind" USING BY VALUE SOCK-FD, BY REFERENCE SOCKADDR-IN, BY VALUE SOCKADDR-IN-LEN RETURNING I.

	IF I NOT EQUALS 0 THEN
		CALL "perror" USING PERROR-BIND
		MOVE -1 TO SOCK-FD
		GOBACK.
	
	*> listen on socket
	CALL "listen" USING BY VALUE SOCK-FD, BACKLOG RETURNING I.

	IF I NOT EQUALS 0 THEN
		CALL "perror" USING PERROR-LISTEN
		MOVE -1 TO SOCK-FD
		GOBACK.
		
	GOBACK.
	
END PROGRAM NETWORK-INIT.

IDENTIFICATION DIVISION.
PROGRAM-ID. NETWORK-RECEIVE.

DATA DIVISION.
WORKING-STORAGE SECTION.

    01 CONN-FD PIC S9(5) COMP-5. *> int
	
	01 PERROR-ACCEPT  PIC A(7) VALUE z"accept".

LINKAGE SECTION.

    COPY dd-network.

PROCEDURE DIVISION USING NETWORK-SHARED, NETWORK-REQUEST.

	*> accept connection
	CALL "accept" USING BY VALUE SOCK-FD, BY REFERENCE SOCKADDR-IN, SOCKADDR-IN-LEN RETURNING CONN-FD.
	
	IF CONN-FD EQUALS -1 THEN
		CALL "perror" USING PERROR-ACCEPT
		MOVE 0 TO REQUEST-LEN
		GOBACK.

    GOBACK.

END PROGRAM NETWORK-RECEIVE.
