*>
*> (c)2026 Ira Parsons
*> xrpc.cbl - xrpc processing routines
*>

*>***************************************************************************
*>* XRPC-HANDLE
*>*  - Parse and respond to xrpc request
*>***************************************************************************

IDENTIFICATION DIVISION.
PROGRAM-ID. XRPC-HANDLE.

DATA DIVISION.
WORKING-STORAGE SECTION.

    01 HANDLER-FUNCTION USAGE PROCEDURE-POINTER.

LINKAGE SECTION.

    COPY dd-http.

    COPY dd-string REPLACING ==(PFX)== BY ==TARGET==.

    COPY dd-string REPLACING ==(PFX)== BY ==BODY==.

PROCEDURE DIVISION USING HTTP-OPTIONS, TARGET-STRING, BODY-STRING.

    *> initialize variables
	MOVE 0 TO HTTP-STATUS-CODE.

    *> validate nsid
    CALL "XRPC-VALIDATE-NSID" USING TARGET-STRING, HANDLER-FUNCTION.

    IF HANDLER-FUNCTION EQUAL NULL THEN
		MOVE 404 TO HTTP-STATUS-CODE
		GOBACK.

    *> find lexicon handler
	CALL "XRPC-GET-HANDLER" USING TARGET-STRING, HANDLER-FUNCTION.

    IF HANDLER-FUNCTION EQUAL NULL THEN
	    MOVE 404 TO HTTP-STATUS-CODE
		GOBACK.

    *> respond to request
	CALL HANDLER-FUNCTION USING HTTP-OPTIONS, BODY-STRING.

    *> if status code not set assume OK
    IF HTTP-STATUS-CODE EQUAL 0 THEN
		MOVE 200 TO HTTP-STATUS-CODE.

    GOBACK.

END PROGRAM XRPC-HANDLE.

*>***************************************************************************
*>* XRPC-VALIDATE-NSID
*>*  - Validate nsid format
*>*  - Locate lexicon handler function
*>***************************************************************************

IDENTIFICATION DIVISION.
PROGRAM-ID. XRPC-VALIDATE-NSID.

DATA DIVISION.
WORKING-STORAGE SECTION.

    01 I PIC S9(5) COMP-5.
    01 J PIC S9(5) COMP-5.
    01 K PIC S9(5) COMP-5.

    *> nsid
	01 DOMAIN-AUTHORITY PIC X(253).
	01 NAME-SEGMENT     PIC X(63).

    COPY dd-string REPLACING ==(PFX)== BY ==TEMP==.

LINKAGE SECTION.

    01 HANDLER-FUNCTION USAGE PROCEDURE-POINTER.

    COPY dd-string REPLACING ==(PFX)== BY ==TARGET==.

PROCEDURE DIVISION USING TARGET-STRING, HANDLER-FUNCTION.

    PERFORM VALIDATE-PARSE.

    GOBACK.

VALIDATE-PARSE.
    *> check for max length
	IF TARGET-LEN IS GREATER THAN 317 THEN
	    PERFORM VALIDATE-INVALID.

    *> separate domain auth from name segment
	MOVE 0 TO I.
	MOVE 1 TO J.
	MOVE 0 TO K.
	PERFORM UNTIL I EQUAL -1
	    COMPUTE TEMP-LEN = TARGET-LEN - J + 1;
		MOVE TARGET-DAT(J:TEMP-LEN) TO TEMP-DAT(1:TEMP-LEN)
		CALL "STRING-STRCHR" USING TEMP-STRING, BY VALUE ".", BY REFERENCE I
		
	    IF I NOT EQUAL -1 THEN
			MOVE "." TO DOMAIN-AUTHORITY(J - 1:1)
			ADD 1 TO K
			MOVE TEMP-DAT(1:I - 1) TO DOMAIN-AUTHORITY(J:I - 1)
		    ADD I TO J
		END-IF

        IF (I EQUAL 1) OR (I IS GREATER THAN 63) THEN
		    PERFORM VALIDATE-INVALID
		END-IF
	END-PERFORM.

	IF (J IS GREATER THAN OR EQUAL TO TARGET-LEN) OR (K IS LESS THAN 3) THEN
	    PERFORM VALIDATE-INVALID.

    COMPUTE I = TARGET-LEN - J + 1;

    IF I IS GREATER THAN 63 THEN
	    PERFORM VALIDATE-INVALID.

    MOVE TARGET-DAT(J:I) TO NAME-SEGMENT.

    SET HANDLER-FUNCTION TO ENTRY "COBLSKY".

    EXIT PARAGRAPH.

VALIDATE-INVALID.
    SET HANDLER-FUNCTION TO NULL.

    GOBACK.

END PROGRAM XRPC-VALIDATE-NSID.

*>***************************************************************************
*>* XRPC-GET-HANDLER
*>*  - Locate lexicon handler
*>*  - Parse and respond to xrpc request
*>***************************************************************************

IDENTIFICATION DIVISION.
PROGRAM-ID. XRPC-GET-HANDLER.

DATA DIVISION.
LINKAGE SECTION.

    01 HANDLER-FUNCTION USAGE PROCEDURE-POINTER.

    COPY dd-string REPLACING ==(PFX)== BY ==TARGET==.

PROCEDURE DIVISION USING TARGET-STRING, HANDLER-FUNCTION.

    *> find handler
	EVALUATE TARGET-DAT(1:TARGET-LEN)
	    COPY pd-xrpc.
	END-EVALUATE.

    GOBACK.

END PROGRAM XRPC-GET-HANDLER.

*>***************************************************************************
*>* XRPC-THROW-ERROR
*>*  - Construct error message
*>***************************************************************************

IDENTIFICATION DIVISION.
PROGRAM-ID. XRPC-THROW-ERROR.

DATA DIVISION.
WORKING-STORAGE SECTION.

    01 ERROR-MESSAGE-JSON.
	    05 ERROR-FIELD   PIC X(256).
		05 MESSAGE-FIELD PIC X(256).

    01 ERROR-KEY   PIC X(6) VALUE z"error".
	01 MESSAGE-KEY PIC X(8) VALUE z"message".

    COPY dd-string REPLACING ==(PFX)== BY ==ERROR==.
    COPY dd-string REPLACING ==(PFX)== BY ==MESSAGE==.

LINKAGE SECTION.

    01 ERROR-STR PIC X(256).
	01 MESSAGE-STR PIC X(256).

    COPY dd-string REPLACING ==(PFX)== BY ==BODY==.

PROCEDURE DIVISION USING BODY-STRING, ERROR-STR, MESSAGE-STR.

>>IF USE_CJSON EQUAL 1
    MOVE 0 TO BODY-LEN.

    MOVE ERROR-STR TO ERROR-DAT.

    CALL "JSON-GENERATE-STRING" USING BODY-STRING, ERROR-KEY, ERROR-STRING.

    IF MESSAGE-STR(1:1) NOT EQUAL X"00" THEN
	    MOVE MESSAGE-STR TO MESSAGE-DAT
        CALL "JSON-GENERATE-STRING" USING BODY-STRING, MESSAGE-KEY, MESSAGE-STRING.

>>ELSE
    MOVE ERROR-STR TO ERROR-FIELD.
	MOVE MESSAGE-STR TO MESSAGE-FIELD.

    JSON GENERATE BODY-DAT
	    FROM ERROR-MESSAGE-JSON
		COUNT IN BODY-LEN
		NAME ERROR-MESSAGE-JSON IS OMITTED
		NAME OF ERROR-FIELD IS "error"
		NAME OF MESSAGE-FIELD IS "message"
		ON EXCEPTION CONTINUE
	END-JSON.
>>END-IF

    GOBACK.

END PROGRAM XRPC-THROW-ERROR.
